/*
*********************************************************************************************************
*
*	模块名称 : BMS模拟模块
*	文件名称 : pgn.h
*	版    本 : V1.0
*	说    明 :
*	修改记录 :
*		版本号   日期       作者     说明
*		v1.0    2017-07-11  vccw     首发
*                                  
*                                   
*
*	Copyright (C), 2017  vccw
*
*********************************************************************************************************
*/
#ifndef     __PGN_H

#define     __PGN_H

#ifdef __cplusplus
extern "C"{
#endif

/****************** 充电握手阶段报文 *******************************************************************/
#define     CHM     0x26U
#define     BHM     0x27U

#define     CRM     0x01U
#define     BRM     0x02U

/****************** 充电参数配置阶段报文 ***************************************************************/
#define     BCP     0x06U
#define     CTS     0x07U
#define     CML     0x08U
#define     BRO     0x09U
#define     CRO     0x0AU

/****************** 充电阶段报文 ***********************************************************************/
#define     BCL     0x10U
#define     BCS     0x11U
#define     CCS     0x12U
#define     BSM     0x13U
#define     BMV     0x15U
#define     BMT     0x16U
#define     BSP     0x17U
#define     BST     0x19U
#define     CST     0x1AU

/****************** 充电结束阶段报文 *******************************************************************/
#define     BSD     0x1C
#define     CSD     0x1D

/****************** 错误报文 ***************************************************************************/
#define     BEM     0x1EU
#define     CEM     0x1FU

#ifdef __cplusplus
}
#endif

#endif

/*************************** vccw(END OF FILE)**********************************************************/